<ul class="about-nav">
	<li class="nav-head">
		关于
	</li>
	<li>
		<a href="/workerman">workerman</a> 
	</li>
	<li>
		<a href="/features">特性</a> 
	</li>
	<li>
		<a href="/license">性能</a>
	</li>
	<li class="active">
		许可 
	</li>
	<li>
		<a href="/contact">联系我们</a>
	</li>
</ul>
<div class="row clearfix">
	<div class="col-md-9 column">
	<h3>协议许可的权利</h3>
	<p>
	workerman官方网站为 http://www.workerman.net，依法独立拥有 workerman 及官网发布的workerman衍生产品著作权。
	workerman及其衍生产品著作权受到法律和国际公约保护。使用者需仔细阅读本协议，在理解、同意、并遵守本协议的全部条款后，方可开始使用 workerman及其衍生 软件。
	</p>
	<p>
	本授权协议适用于http://www.workerman.net发布的所有应用程序，workerman官方网站拥有对本授权协议的最终解释权。
	</p>
	<h3>协议规定的约束和限制</h3>
	<p>
	workerman软件及其workerman官网发布的workerman衍生产品在没有相关说明的情况下默认是免费的，可用于商业用途或者非商业用途。但是无论用途如何，是否经过修改，修改程度如何，未经过许可，
	页面上的产品名称以及指向官网的连接还有源代码中关于workerman的版权信息及作者信息必须保留，不许修改或删除，除非您获得workerman官网的许可。
	禁止在 workerman及官网发布的衍生产品 的整体或任何部分基础上以发展任何派生版本、修改版本或第三方版本用于重新分发。 
	</p>
	<p>
	如果您未能遵守本协议的条款，您的授权将被终止，所被许可的权利将被收回，并承担相应法律责任。
	</p>
	<h3>有限担保和免责声明</h3>
	<p>
	本软件及所附带的文件是作为不提供任何明确的或隐含的赔偿或担保的形式提供的。
	用户出于自愿而使用本软件，您必须了解使用本软件的风险，在尚未购买产品技术服务之前，我们不承诺提供任何形式的技术支持、使用担保，也不承担任何因使用本软件而产生问题的相关责任。 
	workerman官网不对使用本软件及官网发布的衍生产品构建的软件中的文章或信息承担责任。 
	</p>
	<p>
	有关 workerman 最终用户授权协议、商业授权与技术服务的详细内容，均由 workerman 官方网站独家提供。workerman官网拥有在不事先通知的情况下，修改授权协议和服务价目表的权力，修改后的协议或价目表对自改变之日起的新授权用户生效。
	电子文本形式的授权协议如同双方书面签署的协议一样，具有完全的和等同的法律效力。您一旦开始安装 workerman以及官网发布的衍生产品，即被视为完全理解并接受本协议的各项条款，在享有上述条款授予的权力的同时，受到相关的约束和限制。
	协议许可范围以外的行为，将直接违反本授权协议并构成侵权，我们有权随时终止授权，责令停止损害，并保留追究相关责任的权力。
	</p>
	</div>
	<div class="col-md-3 column">
	
	</div>
</div>
